# FullDownload Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
CreateRelatedFileProgressChangedEventArgs..::..FullDownload Property
CreateRelatedFileProgressChangedEventArgs Class See Also
---
Indicates if download the full data of the document, which will take longer than subsequent downloads.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public bool FullDownload { get; }
```

Visual Basic
---
```text
Public ReadOnly Property FullDownload As Boolean
	Get
```

Visual C++
---
```text
public:
property bool FullDownload {
	bool get ();
}
```

# See Also
CreateRelatedFileProgressChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace